Ran Plan for 3 projects:

1. project: `staging-IaC` dir: `staging` workspace: `staging-workspace`
1. project: `production-IaC` dir: `production` workspace: `production-workspace`
1. project: `development-IaC` dir: `development` workspace: `development-workspace`
---

### 1. project: `staging-IaC` dir: `staging` workspace: `staging-workspace`
<details><summary>Show Output</summary>

```diff
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/organization-aws-1/staging-workspace/runs/run-EZi7AbtweKhJ7bsU

Waiting for the plan to start...

Terraform v1.9.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_egress_only_internet_gateway.staging_igw-egress-gw will be created
+ resource "aws_egress_only_internet_gateway" "staging_igw-egress-gw" {
      + id       = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_eip.staging_web-server-eip will be created
+ resource "aws_eip" "staging_web-server-eip" {
      + allocation_id             = (known after apply)
      + associate_with_private_ip = "10.0.1.50"
      + association_id            = (known after apply)
      + carrier_ip                = (known after apply)
      + customer_owned_ip         = (known after apply)
      + domain                    = (known after apply)
      + id                        = (known after apply)
      + instance                  = (known after apply)
      + network_border_group      = (known after apply)
      + network_interface         = (known after apply)
      + private_dns               = (known after apply)
      + private_ip                = (known after apply)
      + public_dns                = (known after apply)
      + public_ip                 = (known after apply)
      + public_ipv4_pool          = (known after apply)
      + tags                      = {
          + "name" = "staging_web-server-eip"
        }
      + tags_all                  = {
          + "name" = "staging_web-server-eip"
        }
      + vpc                       = true
    }

  # aws_instance.staging_web-server will be created
+ resource "aws_instance" "staging_web-server" {
      + ami                                  = "ami-0497a974f8d5dcef8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-southeast-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "name" = "staging_web-server"
        }
      + tags_all                             = {
          + "name" = "staging_web-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "c19ee1a27e9d9def5b8373af11491e0d4668610c"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.staging_igw will be created
+ resource "aws_internet_gateway" "staging_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "name" = "staging"
        }
      + tags_all = {
          + "name" = "staging"
        }
      + vpc_id   = (known after apply)
    }

  # aws_network_interface.staging_web-server-nic will be created
+ resource "aws_network_interface" "staging_web-server-nic" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = [
          + "10.0.1.50",
        ]
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = (known after apply)
      + tags                      = {
          + "name" = "staging_web-server-nic"
        }
      + tags_all                  = {
          + "name" = "staging_web-server-nic"
        }

      + attachment (known after apply)
    }

  # aws_route_table.staging_route_table will be created
+ resource "aws_route_table" "staging_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + egress_only_gateway_id     = (known after apply)
              + ipv6_cidr_block            = "::/0"
                # (12 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (12 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "name" = "staging"
        }
      + tags_all         = {
          + "name" = "staging"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.staging_public-subnet_association will be created
+ resource "aws_route_table_association" "staging_public-subnet_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.staging_public-sg will be created
+ resource "aws_security_group" "staging_public-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.staging_public-subnet will be created
+ resource "aws_subnet" "staging_public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "name" = "staging-public"
        }
      + tags_all                                       = {
          + "name" = "staging-public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.staging_vpc will be created
+ resource "aws_vpc" "staging_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "name" = "staging"
        }
      + tags_all                             = {
          + "name" = "staging"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instance_id        = (known after apply)
+ instance_public_ip = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging-IaC
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://5ade-222-252-248-62.ngrok-free.app/lock?id=llamasad%252Fatlantis-terraform-project%252Fstaging%252Fstaging-workspace)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging-IaC
  ```
Plan: 10 to add, 0 to change, 0 to destroy.

---
### 2. project: `production-IaC` dir: `production` workspace: `production-workspace`
<details><summary>Show Output</summary>

```diff
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/organization-aws-1/production-workspace/runs/run-mmxeJGHgj2xDJqDx

Waiting for the plan to start...

Terraform v1.9.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_egress_only_internet_gateway.production_igw-egress-gw will be created
+ resource "aws_egress_only_internet_gateway" "production_igw-egress-gw" {
      + id       = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_eip.production_web-server-eip will be created
+ resource "aws_eip" "production_web-server-eip" {
      + allocation_id             = (known after apply)
      + associate_with_private_ip = "10.0.1.50"
      + association_id            = (known after apply)
      + carrier_ip                = (known after apply)
      + customer_owned_ip         = (known after apply)
      + domain                    = (known after apply)
      + id                        = (known after apply)
      + instance                  = (known after apply)
      + network_border_group      = (known after apply)
      + network_interface         = (known after apply)
      + private_dns               = (known after apply)
      + private_ip                = (known after apply)
      + public_dns                = (known after apply)
      + public_ip                 = (known after apply)
      + public_ipv4_pool          = (known after apply)
      + tags                      = {
          + "name" = "production_web-server-eip"
        }
      + tags_all                  = {
          + "name" = "production_web-server-eip"
        }
      + vpc                       = true
    }

  # aws_instance.production_web-server will be created
+ resource "aws_instance" "production_web-server" {
      + ami                                  = "ami-0497a974f8d5dcef8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-southeast-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "name" = "production_web-server"
        }
      + tags_all                             = {
          + "name" = "production_web-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "2fcdf10394c14266911bca98d2bbad79f81389b5"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.production_igw will be created
+ resource "aws_internet_gateway" "production_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "name" = "production"
        }
      + tags_all = {
          + "name" = "production"
        }
      + vpc_id   = (known after apply)
    }

  # aws_network_interface.production_web-server-nic will be created
+ resource "aws_network_interface" "production_web-server-nic" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = [
          + "10.0.1.50",
        ]
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = (known after apply)
      + tags                      = {
          + "name" = "production_web-server-nic"
        }
      + tags_all                  = {
          + "name" = "production_web-server-nic"
        }

      + attachment (known after apply)
    }

  # aws_route_table.production_route_table will be created
+ resource "aws_route_table" "production_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + egress_only_gateway_id     = (known after apply)
              + ipv6_cidr_block            = "::/0"
                # (12 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (12 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "name" = "production"
        }
      + tags_all         = {
          + "name" = "production"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.production_public-subnet_association will be created
+ resource "aws_route_table_association" "production_public-subnet_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.production_public-sg will be created
+ resource "aws_security_group" "production_public-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.production_public-subnet will be created
+ resource "aws_subnet" "production_public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "name" = "production-public"
        }
      + tags_all                                       = {
          + "name" = "production-public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.production_vpc will be created
+ resource "aws_vpc" "production_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "name" = "production"
        }
      + tags_all                             = {
          + "name" = "production"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instance_id        = (known after apply)
+ instance_public_ip = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production-IaC
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://5ade-222-252-248-62.ngrok-free.app/lock?id=llamasad%252Fatlantis-terraform-project%252Fproduction%252Fproduction-workspace)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production-IaC
  ```
Plan: 10 to add, 0 to change, 0 to destroy.

---
### 3. project: `development-IaC` dir: `development` workspace: `development-workspace`
<details><summary>Show Output</summary>

```diff
aws_security_group.development_public-sg: Drift detected (update)
aws_egress_only_internet_gateway.development_igw-egress-gw: Drift detected (update)
aws_instance.web-server: Drift detected (update)
aws_network_interface.web-server-nic: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_eip.development_web-server-eip will be created
+ resource "aws_eip" "development_web-server-eip" {
      + allocation_id             = (known after apply)
      + associate_with_private_ip = "10.0.1.50"
      + association_id            = (known after apply)
      + carrier_ip                = (known after apply)
      + customer_owned_ip         = (known after apply)
      + domain                    = (known after apply)
      + id                        = (known after apply)
      + instance                  = (known after apply)
      + network_border_group      = (known after apply)
      + network_interface         = (known after apply)
      + private_dns               = (known after apply)
      + private_ip                = (known after apply)
      + public_dns                = (known after apply)
      + public_ip                 = (known after apply)
      + public_ipv4_pool          = (known after apply)
      + tags                      = {
          + "name" = "development_web-server-eip"
        }
      + tags_all                  = {
          + "name" = "development_web-server-eip"
        }
      + vpc                       = true
    }

  # aws_eip.web-server-eip will be destroyed
- resource "aws_eip" "web-server-eip" {
      - allocation_id             = "eipalloc-0aa917a6cdc675e4b" -> null
      - associate_with_private_ip = "10.0.1.50" -> null
      - association_id            = "eipassoc-019356be21e4551c5" -> null
      - domain                    = "vpc" -> null
      - id                        = "eipalloc-0aa917a6cdc675e4b" -> null
      - instance                  = "i-0e9838b9af8de0cdb" -> null
      - network_border_group      = "ap-southeast-1" -> null
      - network_interface         = "eni-0302901a836d41785" -> null
      - private_dns               = "ip-10-0-1-50.ap-southeast-1.compute.internal" -> null
      - private_ip                = "10.0.1.50" -> null
      - public_dns                = "ec2-54-254-134-14.ap-southeast-1.compute.amazonaws.com" -> null
      - public_ip                 = "54.254.134.14" -> null
      - public_ipv4_pool          = "amazon" -> null
      - tags                      = {
          - "name" = "web-server-eip"
        } -> null
      - tags_all                  = {
          - "name" = "web-server-eip"
        } -> null
      - vpc                       = true -> null
        # (3 unchanged attributes hidden)
    }

  # aws_instance.development_web-server will be created
+ resource "aws_instance" "development_web-server" {
      + ami                                  = "ami-0497a974f8d5dcef8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-southeast-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "name" = "development_web-server"
        }
      + tags_all                             = {
          + "name" = "development_web-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "dcf6d31f0ba081ecd799c34d64103fd7f5fa90d6"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.web-server will be destroyed
- resource "aws_instance" "web-server" {
      - ami                                  = "ami-0497a974f8d5dcef8" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:471112844445:instance/i-0e9838b9af8de0cdb" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0e9838b9af8de0cdb" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "main-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0302901a836d41785" -> null
      - private_dns                          = "ip-10-0-1-50.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "10.0.1.50" -> null
      - public_ip                            = "54.254.134.14" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0e047d762bf7c1ec1" -> null
      - tags                                 = {
          - "name" = "web-server"
        } -> null
      - tags_all                             = {
          - "name" = "web-server"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "3cbfb9903aa4ca83ad9083f114c9c64b197f4984" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0eb32957748749742",
        ] -> null
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - network_interface {
          - delete_on_termination = false -> null
          - device_index          = 0 -> null
          - network_card_index    = 0 -> null
          - network_interface_id  = "eni-0302901a836d41785" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07c6a5fbdf7a802b8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_network_interface.development_web-server-nic will be created
+ resource "aws_network_interface" "development_web-server-nic" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = [
          + "10.0.1.50",
        ]
      + private_ips_count         = (known after apply)
      + security_groups           = [
          + "sg-0eb32957748749742",
        ]
      + source_dest_check         = true
      + subnet_id                 = "subnet-0e047d762bf7c1ec1"
      + tags                      = {
          + "name" = "development_web-server-nic"
        }
      + tags_all                  = {
          + "name" = "development_web-server-nic"
        }

      + attachment (known after apply)
    }

  # aws_network_interface.web-server-nic will be destroyed
- resource "aws_network_interface" "web-server-nic" {
      - arn                       = "arn:aws:ec2:ap-southeast-1:471112844445:network-interface/eni-0302901a836d41785" -> null
      - id                        = "eni-0302901a836d41785" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "02:f7:a1:60:c9:65" -> null
      - owner_id                  = "471112844445" -> null
      - private_ip                = "10.0.1.50" -> null
      - private_ip_list           = [
          - "10.0.1.50",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.1.50",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-0eb32957748749742",
        ] -> null
      - source_dest_check         = true -> null
      - subnet_id                 = "subnet-0e047d762bf7c1ec1" -> null
      - tags                      = {
          - "name" = "web-server-nic"
        } -> null
      - tags_all                  = {
          - "name" = "web-server-nic"
        } -> null
        # (3 unchanged attributes hidden)

      - attachment {
          - attachment_id = "eni-attach-0e2901d3b212402d3" -> null
          - device_index  = 0 -> null
          - instance      = "i-0e9838b9af8de0cdb" -> null
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
~ instance_id        = "i-0e9838b9af8de0cdb" -> (known after apply)
~ instance_public_ip = "54.254.134.14" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p development-IaC
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://5ade-222-252-248-62.ngrok-free.app/lock?id=llamasad%252Fatlantis-terraform-project%252Fdevelopment%252Fdevelopment-workspace)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p development-IaC
  ```
Plan: 3 to add, 0 to change, 3 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```